zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dsi.c
  /*
   * Table of PLL frequency range & PLL regulation settings versus target PHI frequency for the Synopsis D-PHY
   * */
  const DSI_PLLRegTypdef_t dsi_pll_regulation[] =
  {
    {0x00, 0x03, 0x0F, 0x0B}, /*  HAL_DSI_DT_80 */
    {0x10, 0x03, 0x0F, 0x0B}, /*  HAL_DSI_DT_90 */
    {0x20, 0x03, 0x0F, 0x0B}, /*  HAL_DSI_DT_100 */
    {0x30, 0x03, 0x09, 0x0B}, /*  HAL_DSI_DT_110 */
    {0x01, 0x03, 0x09, 0x0B}, /*  HAL_DSI_DT_120 */
    {0x11, 0x03, 0x09, 0x0B}, /*  HAL_DSI_DT_130 */
    {0x21, 0x03, 0x09, 0x0B}, /*  HAL_DSI_DT_140 */
    {0x31, 0x03, 0x09, 0x0B}, /*  HAL_DSI_DT_150 */
    {0x02, 0x02, 0x0F, 0x0B}, /*  HAL_DSI_DT_160 */
    {0x12, 0x02, 0x0F, 0x0B}, /*  HAL_DSI_DT_170 */
    {0x22, 0x02, 0x0F, 0x0B}, /*  HAL_DSI_DT_180 */
    {0x32, 0x02, 0x0F, 0x0B}, /*  HAL_DSI_DT_190 */
    {0x03, 0x02, 0x0F, 0x0B}, /*  HAL_DSI_DT_205 */
    {0x13, 0x02, 0x09, 0x0B}, /*  HAL_DSI_DT_220 */
    {0x23, 0x02, 0x09, 0x0B}, /*  HAL_DSI_DT_235 */
    {0x33, 0x02, 0x09, 0x0B}, /*  HAL_DSI_DT_250 */
    {0x04, 0x02, 0x09, 0x0B}, /*  HAL_DSI_DT_275 */
    {0x14, 0x02, 0x09, 0x0B}, /*  HAL_DSI_DT_300 */
    {0x25, 0x01, 0x0F, 0x0B}, /*  HAL_DSI_DT_325 */
    {0x35, 0x01, 0x0F, 0x0B}, /*  HAL_DSI_DT_350 */
    {0x05, 0x01, 0x0F, 0x0B}, /*  HAL_DSI_DT_400 */
    {0x16, 0x01, 0x09, 0x0B}, /*  HAL_DSI_DT_450 */
    {0x26, 0x01, 0x09, 0x0B}, /*  HAL_DSI_DT_500 */
    {0x37, 0x01, 0x09, 0x0B}, /*  HAL_DSI_DT_550 */
    {0x07, 0x01, 0x09, 0x0B}, /*  HAL_DSI_DT_600 */
    {0x18, 0x00, 0x0F, 0x0B}, /*  HAL_DSI_DT_650 */
    {0x28, 0x00, 0x0F, 0x0B}, /*  HAL_DSI_DT_700 */
    {0x39, 0x00, 0x0F, 0x0B}, /*  HAL_DSI_DT_750 */
    {0x09, 0x00, 0x0F, 0x0B}, /*  HAL_DSI_DT_800 */
    {0x19, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_850 */
    {0x29, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_900 */
    {0x3A, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_950 */
    {0x0A, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1000 */
    {0x1A, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1050 */
    {0x2A, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1100 */
    {0x3B, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1150 */
    {0x0B, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1200 */
    {0x1B, 0x00, 0x09, 0x0B}, /*  HAL_DSI_DT_1250 */
    {0x2B, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1300 */
    {0x3C, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1350 */
    {0x0C, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1400 */
    {0x1C, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1450 */
    {0x2C, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1500 */
    {0x3D, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1550 */
    {0x0D, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1600 */
    {0x1D, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1650 */
    {0x2E, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1700 */
    {0x3E, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1750 */
    {0x0E, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1800 */
    {0x1E, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1850 */
    {0x2F, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1900 */
    {0x3F, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_1950 */
    {0x0F, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_2000 */
    {0x40, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_2050 */
    {0x41, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_2100 */
    {0x42, 0x00, 0x03, 0x0B}, /*  HAL_DSI_DT_2150 */
    {0x43, 0x00, 0x01, 0x0B}, /*  HAL_DSI_DT_2200 */
    {0x44, 0x00, 0x01, 0x0B}, /*  HAL_DSI_DT_2250 */
    {0x45, 0x00, 0x01, 0x0C}, /*  HAL_DSI_DT_2300 */
    {0x46, 0x00, 0x01, 0x0C}, /*  HAL_DSI_DT_2350 */
    {0x47, 0x00, 0x01, 0x0C}, /*  HAL_DSI_DT_2400 */
    {0x48, 0x00, 0x01, 0x0C}, /*  HAL_DSI_DT_2450 */
    {0x49, 0x00, 0x01, 0x0C}  /*  HAL_DSI_DT_2500 */
  };

  /* The Wrapper controls the PLL (via registers DSI_WRPCR0/1/2) but not the PHY Test Registers */
  CLEAR_BIT(hdsi->Instance->WRPCR0, DSI_WRPCR0_PSC);

  /* clear the pll shadow regs */
  hdsi->Instance->WRPCR2 |= DSI_WRPCR2_CLR;
  hdsi->Instance->WRPCR2 &= ~(DSI_WRPCR2_CLR);

  /* require minimum 1ms delay */
  HAL_Delay(1);

  /* Set pll parameters */
  hdsi->Instance->WRPCR0 &= ~(DSI_WRPCR0_IDF | DSI_WRPCR0_NDIV);
  hdsi->Instance->WRPCR0 = (PLLInit->PLLIDF << DSI_WRPCR0_IDF_Pos) | (PLLInit->PLLNDIV << DSI_WRPCR0_NDIV_Pos);
  hdsi->Instance->WRPCR1 = (PLLInit->PLLODF << DSI_WRPCR1_ODF_Pos) | \
                           ((uint32_t)dsi_pll_regulation[hdsi->Init.PhyDataRate].vco << DSI_WRPCR1_VCO_Pos) | \
                           (DSI_PLL_BIAS_FIELD << DSI_WRPCR1_BIAS_Pos) | \
                           (DSI_PLL_INT_FIELD << DSI_WRPCR1_INT_Pos) | \
                           (DSI_PLL_GMP_FIELD << DSI_WRPCR1_GMP_Pos) | \
                           ((uint32_t)dsi_pll_regulation[hdsi->Init.PhyDataRate].prop << DSI_WRPCR1_PROP_Pos);

  /* Calculate Input Clock Frequency */
  tmp = (((PLLInit->RefClkin / 1000U) - 17U)) * 4U;

  hdsi->Instance->WPCR1 = (0x00UL << DSI_WPCR1_DLD_Pos) | \
                          ((uint32_t)dsi_pll_regulation[hdsi->Init.PhyDataRate].hs_freq << DSI_WPCR1_HSFR_Pos) | \
                          (tmp << DSI_WPCR1_CCF_Pos);

  /* Select output generated clock by PLL*/
  hdsi->Instance->WRPCR2 |= (0x01U << DSI_WRPCR2_SEL_Pos);

  /* Trigger the update of effective PLL registers */
  hdsi->Instance->WRPCR2 |= DSI_WRPCR2_UPD;
  /*Requires minimum width of triggered update pulse*/
  /* 1ms delay is inserted that is the minimum HAL delay granularity */
  HAL_Delay(1);
  hdsi->Instance->WRPCR2 &= ~(DSI_WRPCR2_UPD);
}
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DSI_Exported_Functions
  * @{
  */

/** @defgroup DSI_Group1 Initialization and Configuration functions
  *  @brief   Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
                ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the DSI
      (+) De-initialize the DSI

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the DSI according to the specified
  *         parameters in the DSI_InitTypeDef and create the associated handle.
  * @param  hdsi  pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @param  PLLInit  pointer to a DSI_PLLInitTypeDef structure that contains
  *                  the PLL Clock structure definition for the DSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DSI_Init(DSI_HandleTypeDef *hdsi, DSI_PLLInitTypeDef *PLLInit)
{
  uint32_t tickstart;

  /* Check the DSI handle allocation */
  if (hdsi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check function parameters */
  assert_param(IS_DSI_PLL_NDIV(PLLInit->PLLNDIV));
  assert_param(IS_DSI_PLL_IDF(PLLInit->PLLIDF));
  assert_param(IS_DSI_PLL_ODF(PLLInit->PLLODF));
  assert_param(IS_DSI_AUTO_CLKLANE_CONTROL(hdsi->Init.AutomaticClockLaneControl));
  assert_param(IS_DSI_NUMBER_OF_LANES(hdsi->Init.NumberOfLanes));
  assert_param(IS_DSI_PHY_DATARATE(hdsi->Init.PhyDataRate));

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
  if (hdsi->State == HAL_DSI_STATE_RESET)
  {
    /* Reset the DSI callback to the legacy weak callbacks */
    hdsi->TearingEffectCallback = HAL_DSI_TearingEffectCallback; /* Legacy weak TearingEffectCallback */
    hdsi->EndOfRefreshCallback  = HAL_DSI_EndOfRefreshCallback;  /* Legacy weak EndOfRefreshCallback  */
    hdsi->ErrorCallback         = HAL_DSI_ErrorCallback;         /* Legacy weak ErrorCallback         */

