zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dsi.c
    if (hdsi->MspInitCallback == NULL)
    {
      hdsi->MspInitCallback = HAL_DSI_MspInit;
    }
    /* Initialize the low level hardware */
    hdsi->MspInitCallback(hdsi);
  }
#else
  if (hdsi->State == HAL_DSI_STATE_RESET)
  {
    /* Initialize the low level hardware */
    HAL_DSI_MspInit(hdsi);
  }
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

  /* Change DSI peripheral state */
  hdsi->State = HAL_DSI_STATE_BUSY;

  /**************** Configure the DSI PLL and Turn on the regulator ****************/
  hdsi->Instance->PCTLR &= ~(DSI_PCTLR_UCKEN | DSI_PCTLR_CKEN | DSI_PCTLR_PWEN | DSI_PCTLR_DEN);

  /* Set PLL Tuning */
  DSI_SetWrapperPLLTuning(hdsi, PLLInit);

  /*************************** Set the PHY parameters ***************************/

  /* Clock lane configuration */
  hdsi->Instance->CLCR &= ~(DSI_CLCR_DPCC | DSI_CLCR_ACR);
  hdsi->Instance->CLCR |= (DSI_CLCR_DPCC | hdsi->Init.AutomaticClockLaneControl);

  /* Configure the number of active data lanes */
  hdsi->Instance->PCONFR &= ~DSI_PCONFR_NL;
  hdsi->Instance->PCONFR |= hdsi->Init.NumberOfLanes;

  /************************ Set the DSI clock parameters ************************/

  /* Set the TX escape clock division factor */
  hdsi->Instance->CCR &= ~DSI_CCR_TXECKDIV;
  hdsi->Instance->CCR |= hdsi->Init.TXEscapeCkdiv;

  /*********************** Perform Powering up Sequence of D-PHY ********************/

  /* D-PHY clock and digital enable */
  hdsi->Instance->PCTLR |= (DSI_PCTLR_CKEN | DSI_PCTLR_PWEN | DSI_PCTLR_DEN);


  /* Enable the DSI PLL */
  __HAL_DSI_PLL_ENABLE(hdsi);

  /* Requires min of 400us delay before reading the PLLLS flag */
  /* 1ms delay is inserted that is the minimum HAL delay granularity */
  HAL_Delay(1);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait for the lock of the PLL */
  while (__HAL_DSI_GET_FLAG(hdsi, DSI_FLAG_PLLLS) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
    {
      hdsi->State = HAL_DSI_STATE_TIMEOUT;
      return HAL_TIMEOUT;
    }
  }

  /*Require minimum delay of 1ms*/
  HAL_Delay(1);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until the D-PHY active clock and data lanes enter into Stop State */
  if (hdsi->Init.NumberOfLanes == DSI_ONE_DATA_LANE)
  {
    while ((hdsi->Instance->PSR & (DSI_PSR_PSSC | DSI_PSR_PSS0)) != (DSI_PSR_PSSC | DSI_PSR_PSS0))
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
      {
        hdsi->State = HAL_DSI_STATE_TIMEOUT;
        return HAL_TIMEOUT;
      }
    }
  }
  else if (hdsi->Init.NumberOfLanes == DSI_TWO_DATA_LANES)
  {
    while ((hdsi->Instance->PSR & (DSI_PSR_PSSC | DSI_PSR_PSS0 | DSI_PSR_PSS1)) != (DSI_PSR_PSSC | \
                                                                                    DSI_PSR_PSS0 | DSI_PSR_PSS1))
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
      {
        hdsi->State = HAL_DSI_STATE_TIMEOUT;
        return HAL_TIMEOUT;
      }
    }
  }
  else if (hdsi->Init.NumberOfLanes == DSI_THREE_DATA_LANES)
  {
    while ((hdsi->Instance->PSR & (DSI_PSR_PSSC | DSI_PSR_PSS0 | DSI_PSR_PSS1 | DSI_PSR_PSS2)) != \
           (DSI_PSR_PSSC | DSI_PSR_PSS0 | DSI_PSR_PSS1 | DSI_PSR_PSS2))
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
      {
        hdsi->State = HAL_DSI_STATE_TIMEOUT;
        return HAL_TIMEOUT;
      }
    }
  }
  else if (hdsi->Init.NumberOfLanes == DSI_FOUR_DATA_LANES)
  {
    while ((hdsi->Instance->PSR & (DSI_PSR_PSSC | DSI_PSR_PSS0 | DSI_PSR_PSS1 | DSI_PSR_PSS2 | \
                                   DSI_PSR_PSS3)) != (DSI_PSR_PSSC | DSI_PSR_PSS0 | \
                                                      DSI_PSR_PSS1 | DSI_PSR_PSS2 | DSI_PSR_PSS3))
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
      {
        hdsi->State = HAL_DSI_STATE_TIMEOUT;
        return HAL_TIMEOUT;
      }
    }
  }
  else
  {
    hdsi->State = HAL_DSI_STATE_ERROR;
    return HAL_ERROR;
  }
  /****************************** Error management *****************************/

  /* Disable all error interrupts and reset the Error Mask */
  hdsi->Instance->IER0 = 0U;
  hdsi->Instance->IER1 = 0U;
  hdsi->ErrorMsk = 0U;

  /* Initialize the error code */
  hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

  /* Initialize the DSI state*/
  hdsi->State = HAL_DSI_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  De-initializes the DSI peripheral registers to their default reset
  *         values.
  * @param  hdsi  pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DSI_DeInit(DSI_HandleTypeDef *hdsi)
{
  /* Check the DSI handle allocation */
  if (hdsi == NULL)
  {
    return HAL_ERROR;
  }

  /* Change DSI peripheral state */
  hdsi->State = HAL_DSI_STATE_BUSY;

  /* Disable the DSI wrapper */
  __HAL_DSI_WRAPPER_DISABLE(hdsi);

  /* Disable the DSI host */
  __HAL_DSI_DISABLE(hdsi);

  /* D-PHY ulps clock, clock, digital and power disable */
  hdsi->Instance->PCTLR &= ~(DSI_PCTLR_UCKEN | DSI_PCTLR_CKEN | DSI_PCTLR_DEN | DSI_PCTLR_PWEN);

  /* Turn off the DSI PLL */
  __HAL_DSI_PLL_DISABLE(hdsi);


#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
  if (hdsi->MspDeInitCallback == NULL)
  {
    hdsi->MspDeInitCallback = HAL_DSI_MspDeInit;
  }
  /* DeInit the low level hardware */
  hdsi->MspDeInitCallback(hdsi);
#else
  /* DeInit the low level hardware */
  HAL_DSI_MspDeInit(hdsi);
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

  /* Initialize the error code */
  hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

  /* Initialize the DSI state*/
  hdsi->State = HAL_DSI_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hdsi);

  return HAL_OK;
}

/**
  * @brief  Enable the error monitor flags
  * @param  hdsi  pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @param  ActiveErrors  indicates which error interrupts will be enabled.
  *                      This parameter can be any combination of @arg DSI_Error_Data_Type.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DSI_ConfigErrorMonitor(DSI_HandleTypeDef *hdsi, uint32_t ActiveErrors)
{
  /* Process locked */
  __HAL_LOCK(hdsi);

  hdsi->Instance->IER0 = 0U;
  hdsi->Instance->IER1 = 0U;

  /* Store active errors to the handle */
  hdsi->ErrorMsk = ActiveErrors;

